package ru.ifmo.cet.javabasics;
import java.nio.charset.Charset;
import java.nio.file.Path;
import java.nio.file.Paths;
import java.util.*;
import java.io.IOException;

import static java.nio.file.Files.readAllLines;

public class WarAndPeaceExercise {
    public static String warAndPeace() throws IOException {
        Map<String, Integer> words = new HashMap<>(); // Сюда закачаются все тома

        find(Paths.get("src", "main", "resources", "WAP12.txt"), words); // Закачали 1, 2 том
        find(Paths.get("src", "main", "resources", "WAP34.txt"), words); // Закачали 3, 4 том

        // Чтобы отсортировать как нам надо, преобразуем карту в список
        List<Map.Entry<String,Integer>> toList = new ArrayList<>(words.entrySet());

        // Сортируем
        toList.sort(new Comparator<Map.Entry<String,Integer>>() {
            @Override
            public int compare(Map.Entry<String, Integer> o1, Map.Entry<String, Integer> o2) {
                // Если встречаемость слов совпадает, то сортируем по тексту слова
                if(o1.getValue().equals(o2.getValue()))
                    return o1.getKey().compareTo(o2.getKey());
                else // иначе сортируем по встречаемости
                    return o2.getValue().compareTo(o1.getValue());
            }
        });

        // Сюда мы запишем результаты
        List<String> lines = new ArrayList<>();

        // Обходим все слова
        for (int i = 0; i < toList.size(); i++) {
            if (toList.get(i).getValue() >= 10) // Если слово встречается более 10 раз
                // Добавляем его в результат
                lines.add(String.format("%s - %d", toList.get(i).getKey(), toList.get(i).getValue()));
        }

        // Преобразуем результаты в одну строку
        return String.join("\n", lines);
    }

    private static void find(Path path, Map<String, Integer> wordMap) throws IOException {

        for (String line : readAllLines(path, Charset.forName("windows-1251"))) {
            // Строки в Java неизменяемы, поэтому чтобы поменять строку,
            // нужно преобразовать её в массив символов
            char[] arr = line.toCharArray();

            // Чтобы оставить только слова, надо все знаки препинания и цифры
            // заменить на пробельные символы
            for (int i = 0; i < arr.length; i++) {
                if (!Character.isLetter(arr[i]))
                    arr[i] = ' ';
            }

            // Обработанный массив преобразовываем обратно к строке
            line = new String(arr);

            for (String word : line.split(" ")) {
                // Сразу отбрасываем слова короче 4 символов
                if (word.length() < 4)
                    continue;

                // Переводим слово в нижний регистр
                word = word.toLowerCase();

                // Записываем счётчики, сколько какого слова
                if (wordMap.containsKey(word)) {
                    wordMap.put(word, wordMap.get(word) + 1);
                }
                else {
                    wordMap.put(word, 1);
                }
            }
        }
    }
}































/*


```````````````````````````````````````````````````````````````````
```````````````````ggggg``````````````````gggggg```````````````````
`````````````````gggggggggggg`````````ggggggggggg``````````````````
````````````````ggg````````gggg`````ggg````````ggg`````````````````
```````````````ggg````````````ggg`ggg```````````ggg````````````````
```````````````gg```````````````ggg``````````````gg````````````````
``````````````gg`````````````````````````````````gg````````````````
``````````````gg```````````````ggggg``````````````gg```````````````
``````````````g`````````gggggggggggggggggg````````gg```````````````
``````````````g``````ggggg``````````````ggggg`````gg```````````````
```````gggggggg````gggg`````````````````````ggg```ggggggggggg``````
```ggggg`````````ggg``````````````````````````ggg`````````gggggg```
`gggg```````````ggg`````````````````````````````ggg```````````gggg`
ggg````````````gg````````````````````````````````ggg````````````gg`
ggg```````````gg``````````````````````````````````ggg```````````gg`
`gg``````````gg````````````````````````````````````ggg`````````ggg`
`ggg````````gg``````````````````````````````````````gg`````````gg``
``gg````````gg```````````````````````````````````````gg```````ggg``
```gg``````gg```````````ggg```````````gggg```````````gg``````ggg```
````ggg````gg``````````ggggg``````````gggg```````````gg``````gg````
``````gg``ggg``````````gggg```````````gggg````````````gg```ggg`````
``````gg``ggg````````````g`````````````gg`````````````gg``ggg``````
`````gg```ggg`````````````````````````````````````````gg````gg`````
```gg``````gg````````````````````````````````````````gg``````ggg```
```gg``````gg````````````g`````````````g`````````````gg```````ggg``
``gg```````gg`````````````g```````````g``````````````gg````````gg``
`gg`````````gg`````````````ggg`````ggg``````````````gg``````````gg`
`gg``````````gg``````````````ggggggg```````````````ggg``````````ggg
`gg``````````ggg```````````````````````````````````gg```````````ggg
``ggg`````````ggg`````````````````````````````````gg``````````gggg`
```gggg````````ggg``````````````````````````````ggg```````gggggg```
``````gggg```````ggg```````````````````````````ggg``gggggggg```````
``````````ggggg```gggg```````````````````````ggg````g``````````````
``````````````g`````gggg``````````````````gggg`````gg``````````````
``````````````gg```````gggggg````````gggggg````````gg``````````````
``````````````gg```````````gggggggggggg```````````gg```````````````
``````````````gg``````````````````````````````````gg```````````````
```````````````gg``````````````gggg``````````````gg````````````````
```````````````ggg```````````gg````gg```````````gg`````````````````
````````````````ggg``````gggg````````ggggg`````gg``````````````````
````````````````gggggggggg``````````````ggggggggg``````````````````

__________¶¶¶______________________________¶¶¶___
___________$¶¶¶¶__________________________¶¶$$¶___
___________¶¶__¶¶______________________¶¶¶¶¶¶_____
____________¶¶__¶$¶__________________¶¶¶¶_¶¶______
_____________¶¶__¶¶¶________________¶¶¶_¶$¶_______
_________¶¶__¶$___¶¶¶_______¶¶____¶¶¶___$¶________
_________¶¶¶__¶¶___¶$¶_____¶¶¶¶__¶$¶__¶$¶_________
__________$¶¶__¶¶___¶$____¶¶_¶¶_¶$¶__¶¶¶__________
__________$¶¶¶__¶$¶¶¶¶¶¶¶¶¶¶¶$¶¶¶___¶¶¶___________
__________¶$¶¶¶¶¶¶¶__________¶¶¶¶¶_¶¶__¶¶¶¶¶¶$¶___
¶¶¶¶¶¶¶____¶¶$¶¶_¶$¶$¶¶___¶¶¶$¶¶¶¶¶$¶¶¶¶¶__¶$¶____
¶¶¶¶¶¶¶¶¶¶¶¶¶¶_¶$¶¶¶¶¶¶__¶$¶¶$¶¶___¶¶_____¶¶¶_____
___¶¶¶¶¶¶___$¶__¶$¶¶¶$¶___¶¶¶¶¶¶____¶¶¶¶¶¶¶¶______
_______¶¶¶¶¶$_________________________¶_¶¶¶_______
___________¶$________¶¶¶¶¶¶___________¶¶¶¶________
_____¶¶¶¶¶¶¶$__¶¶____$¶¶¶¶$___________¶¶__________
__¶¶¶¶¶_____$__¶¶______¶¶¶___________¶$___________
¶¶¶¶¶¶¶¶¶¶¶¶$¶¶¶¶¶_____________¶¶___¶$¶¶__________
___________¶$¶¶¶_¶¶¶¶________¶¶¶____¶$¶¶¶¶________
_________¶$¶_$_____¶¶¶¶¶¶¶¶¶¶¶_____¶$¶___¶¶¶______
_________$¶_¶¶¶¶_________________¶¶¶¶¶¶¶¶¶¶¶¶_____
________¶¶¶¶¶_¶¶¶¶¶¶________¶¶¶¶¶$_________¶¶¶____
_______¶$¶¶____¶$¶¶¶¶¶$¶¶¶¶¶¶¶¶__$________________
______________¶$¶¶¶¶¶_¶¶__¶¶_¶¶¶¶¶________________
_____________¶¶¶¶¶____¶¶__¶¶__¶¶¶¶________________
_____________¶________¶¶_¶¶_____¶¶________________
______________________¶¶_¶¶_______________________
_______________________¶¶$________________________
_______________________¶$¶________________________
_______________________¶¶_________________________
 */